<template>
    <div class="container">
        <div class="top">
            <div class="it">
                <svg t="1721444012559" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="5950" width="20" height="20">
                    <path
                        d="M629.333333 117.333333V448h277.333334v458.666667h-789.333334v-789.333334h512z m-64 64h-384v661.333334h85.333334v-192h213.333333v192h85.333333v-661.333334z m277.333334 330.666667h-213.333334v330.666667h213.333334V512z m-426.666667 202.666667h-85.333333v128h85.333333v-128z m362.666667-10.666667v64h-86.656v-64H778.666667z m0-128v64h-86.656v-64H778.666667zM404.010667 266.666667V341.333333h74.666666v64h-74.666666v74.666667h-64V405.333333h-74.666667v-64h74.666667v-74.666666h64z"
                        fill="#f94c2d98" p-id="5951"></path>
                </svg>
                <span>常见科室</span>
            </div>
            <div>全部 ></div>
        </div>
        <div class="keshi">
            <span>神经内科</span>
            <span>消化内科</span>
            <span>呼吸内科</span>
            <span>内科</span>
            <span>神经外科</span>
            <span>妇科</span>
            <span>产科</span>
            <span>儿科</span>
        </div>
        <div class="top">
            <div class="it">
                <svg t="1721444337588" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="7372" width="20" height="20">
                    <path
                        d="M642.744 1013.924c-7.588 0-15.063-2.775-20.94-8.1L317.07 731.597h-176.23c-50.453 0-125.481-33.424-125.481-125.481V417.905c0-50.453 33.444-125.481 125.47-125.481H317L621.732 18.135c9.206-8.346 22.456-10.353 33.74-5.325a31.315 31.315 0 0 1 18.637 28.672v941.066c0 12.37-7.219 23.655-18.565 28.683a31.639 31.639 0 0 1-12.8 2.693z m-501.913-658.75c-59.73 0-62.73 52.255-62.73 62.74v188.212c0 59.658 52.264 62.74 62.73 62.74h188.21c7.783 0 15.248 2.878 20.952 8.1l261.376 235.131V111.923L350.075 347.075c-5.775 5.201-13.23 8.1-21.023 8.1H140.831zM799.58 323.8c-7.957 0-16.047-3.082-22.201-9.165-12.237-12.226-12.237-32.123 0-44.36l125.48-125.48c12.227-12.217 32.103-12.217 44.36 0 12.227 12.236 12.227 32.133 0 44.37l-125.47 125.47c-6.103 6.083-14.06 9.165-22.17 9.165zM987.8 543.375h-188.22c-17.245 0-31.366-14.039-31.366-31.365 0-17.316 14.121-31.365 31.365-31.365h188.222c17.377 0 31.365 14.06 31.365 31.365 0 17.326-13.988 31.365-31.365 31.365z m-62.74 345.068a31.582 31.582 0 0 1-22.2-9.165L777.38 753.798c-12.237-12.227-12.237-32.103 0-44.36 12.226-12.217 32.102-12.217 44.37 0l125.47 125.47c12.227 12.257 12.227 32.144 0 44.37-6.092 6.093-14.049 9.165-22.159 9.165z m0 0"
                        fill="" p-id="7373"></path>
                </svg>
                <span>平台公告</span>
            </div>
            <div>全部 ></div>
        </div>
        <ul class="info">
            <li><span class="i-text">北京协和医院走进天坛街道开展义诊、科普活动</span></li>
            <li><span class="i-text">受试者招募 | 乏力、消瘦的老年人看过来~</span></li>
            <li><span class="i-text">骨质疏松症门诊开诊 为骨骼健康保驾护航 </span></li>
        </ul>
        <div class="top">
            <div class="it">
                <svg t="1721444435708" class="icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="10995" width="20" height="20">
                    <path
                        d="M512 0C373.76 0 245.76 51.2 148.48 148.48 56.32 245.76 0 373.76 0 506.88 0 793.6 225.28 1024 506.88 1024c286.72 0 517.12-225.28 517.12-506.88C1024 230.4 798.72 0 512 0z m0 957.44c-250.88 0-450.56-199.68-445.44-450.56 0-245.76 199.68-445.44 445.44-440.32 245.76 0 445.44 199.68 445.44 445.44 0 250.88-194.56 445.44-445.44 445.44zM460.8 424.96v163.84c0 35.84 20.48 46.08 56.32 46.08 35.84 0 35.84-20.48 35.84-46.08 5.12-97.28 5.12-194.56 10.24-291.84 5.12-35.84 0-61.44-51.2-61.44S455.68 256 455.68 296.96L460.8 424.96z m117.76 337.92c-5.12 40.96-30.72 61.44-66.56 61.44-35.84 0-61.44-20.48-66.56-56.32-5.12-40.96 20.48-61.44 61.44-61.44 40.96-5.12 61.44 20.48 71.68 56.32z"
                        fill="#FAB427" p-id="10996"></path>
                </svg>
                <span>停诊公告</span>
            </div>
            <div>全部 ></div>
        </div>
        <ul class="stop">
            <li><span class="i-text">停电停诊公告</span></li>
            <li><span class="i-text">首都医科大学附属北京潞河医院老年医学科门诊停诊公告</span></li>
        </ul>
    </div>
</template>
<script setup lang="ts">
</script>
<style scoped>
.container {
    width: 90%;
    color: #7f7f7f;
    font-weight: 500;
}

.top {
    display: flex;
    justify-content: space-between;
    margin-left: -10px;
}

.keshi {
    margin-top: 20px;
    width: 80%;
    display: grid;
    grid-template-columns: 1fr 1fr;
    margin-bottom: 40px;
    column-gap: 20px;
    row-gap: 5px;
}

.it {
    display: flex;
    gap: 5px;
}

.info,
.stop {
    margin-top: 20px;
    margin-left: 10px;
    margin-bottom: 40px;
}


.info li {
    color: #50AEB1;
    font-size: 10px;
}

.stop li {
    color: #FFCE54;
    font-size: 10px;
}

.i-text {
    color: #7f7f7f;
    font-size: 16px;
}
</style>
